<?php

function pageLoad() {

    global $ActionFlag, $RealPid, $parent_idx, $idx;
	global $MisSession_UserID, $MisSession_IsAdmin, $parent_RealPid;
/*
	//특정상황에서 페이지를 이동시키는 예제입니다.
	if($ActionFlag=='list' && $parent_RealPid=='speedmis000028') {
		$target_parent_gubun = RealPidIntoGubun('speedmis001071');
		$url = "index.php?RealPid=$RealPid&parent_gubun=$target_parent_gubun&parent_idx=$parent_idx";
		re_direct($url);
	}
*/

        ?>

<style>
/* 필요할 경우, 해당프로그램에 추가할 css 를 넣으세요 */
	
	
</style>


        <script>
			
//아래 한줄의 주석문을 풀면 리스트 상에서 내용조회나 수정으로 접근할 수 없습니다.
$('body').attr('onlylist','');			
//아래 한줄의 주석문을 풀면 리스트 상에서 목록1개만 로딩되어도 자동내용열림을 방지할 수 있습니다.
//$('body').attr('auto_open_refuse','');	
			
//간편추가 쿼리를 팝업이 아닌, 현재창에서 진행합니다.			
//$('body').attr('brief_insert_this_page','');
			
			
//엑셀을 이용한 인쇄폼에서 PDF 로 저장할 경우, 또는 인쇄폼에서 PDF 로 저장할 경우 용지나 여백을 조정해야할 경우.
/*
function thisPage_options_pdf() {
    return {
        paperSize: "A4",
		scale: 0.567,
		landscape: false,
		margin: { left: "0.2cm", top: "0.9cm", right: "1.0cm", bottom: "0.5cm" }
    }
}
*/
	
			
			
//웹소스 디테일에서 템플릿으로 체크한 항목에 대해 출력내용을 변경할 수 있습니다. 이때 목록 또는 본문내용에 동일하게 적용됩니다.
//row 갯수만큼 실행됩니다.
			
/*

function columns_templete(p_dataItem, p_aliasName) {

    if(p_aliasName=='AutoGubun') {

		//웹소스디테일의 데이터타입을 number^^#,##0 라고 지정 및 템플릿을 Y 로 했을 경우, 아래와 같은 식으로 하면 number 포맷으로 출력할 수 있음.
		//rValue = rValue + columns_format(p_dataItem, p_aliasName);


		var rValue = '<a href="index.php?RealPid=' + p_dataItem['RealPid'] + '&isMenuIn=Y" target="_blank" class="k-button">Go</a>';
		if(p_dataItem['MenuType']=='01') {
			rValue = rValue + '<a id="aid_' + p_dataItem['idx'] + '" href="index.php?RealPid=speedmis000266&idx=' 
				+ p_dataItem['RealPid'] + '&isMenuIn=Y" target="_blank" class="k-button">Source</a>';
		} else if(p_dataItem['MenuType']=='22') {
			rValue = rValue + '<a id="aid_' + p_dataItem['idx'] + '" href="index.php?RealPid=speedmis000989&idx=' 
				+ p_dataItem['RealPid'] + '&isMenuIn=Y" target="_blank" class="k-button">Source</a>';
		}
		rValue = rValue + p_dataItem['AutoGubun'];
        return rValue;
    } else {
        return p_dataItem[p_aliasName];
    }
}
*/

			
			
//아래의 함수는 목록에서만 해당되며, 템플릿으로 정의하지 않아도 특정항목의 값이나 태그를 추가할 수 있습니다. 
//row 갯수만큼 실행됩니다.
function rowFunction_UserDefine(p_this) {
/*
	p_this.MenuName = p_this.depth + p_this.LanguageCode; 
    p_this.AutoGubun = 
    "<a href=index.asp?gubun=" + p_this.idx + "&isMenuIn=Y target=_blank>[Go]</a> <a id='aid_" + p_this.idx + "' href=index.asp?RealPid=speedmis000266&idx=" + p_this.idx + "&isMenuIn=Y target=_blank>[Source]</a>?" 
    + p_this.AutoGubun;
*/
}

			
//아래는 그리드의 로딩이 거의 끝난 후, 항목에 스타일 시트를 적용하는 예입니다. 스타일 등을 직접 변경하려면 이 함수를 이용해야 합니다.
//row 갯수만큼 실행됩니다.
function rowFunctionAfter_UserDefine(p_this) {
/*
    if(p_this.AutoGubun.length==6) {
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).css("color","transparent");
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).css("color","transparent");
    } else if(p_this.AutoGubun.length==4) {
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).css("color","transparent");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).css("color","transparent");
    } else if(p_this.AutoGubun.length==2) {
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).css("color","transparent");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).css("color","transparent");
    }
*/
}
			
<?php 
//해당프로그램의 관리자 권한을 가진 사용자는 $MisSession_IsAdmin=='Y' 입니다. 필요 시, 여러 부분에서 해당 조건을 넣어 사용하세요.
//if($MisSession_IsAdmin=='Y' && $ActionFlag=='list') { 
			
//}
?>
//사용자 정의버튼 생성 예제입니다.
//툴바 명령버튼에 btn_1 이라고 하는 예비버튼을 "적용" 이라는 기능을 넣고, 클릭 시, 그리드에 app="적용" 이라는 신호로 보냅니다.
//이때 app=="적용" 에 대한 처리는 개발Tip 의 list_json_init() 를 참조하세요.
function thisLogic_toolbar() {
/*
    $("a#btn_1").text("적용");
    $("li#btn_1_overflow").text("적용");
    $("#btn_1").css("background", "#88f");
    $("#btn_1").css("color", "#fff");
    $("#btn_1").click( function() {
        $("#grid").data("kendoGrid").dataSource.transport.options.read.data.app = "적용";
        $("#grid").data("kendoGrid").dataSource.read();
        $("#grid").data("kendoGrid").dataSource.transport.options.read.data.app = "";
    });
*/
}

//목록에서 grid 로드 후 한번만 실행됨, 이때 처리해야할 일반 스크립트를 삽입합니다.
function listLogic_afterLoad_once()	{
	//grid_remove_sort();    //그리드의 상단 정렬 기능 제거를 원할 경우.
	
}
			
//목록에서 grid 로드 후 데이터 로딩마다 실행됨, 이때 처리해야할 일반 스크립트를 삽입합니다.		
function listLogic_afterLoad_continue()	{
	
	
}

function helpboxLogic_afterSelect(p_actionFlag, p_opener, p_sel_alias, p_sel_value) {
	//dropdownlist 에 의한 helplist (popup) 선택 직후 추가 작업이 필요할 경우 사용합니다.
	/*
	if(p_actionFlag=='write' && p_sel_alias=='TUNE_CD') {
		v = p_sel_value;
		//p_opener.$('input#vTUNE_CD')[0].value = v;
	}
	*/
	
}

//업무용 MIS 의 목록형태가 save_templist 일 경우, 데이터가 추가될때마다 자동화면clear 대신 임의설정을 하고자할때 활성화 시켜서 사용할 것.
/*			
function templist_write_form_clear() {
    
	//자동 forme clear
    //write_form_clear();  
	
	//입력컨트롤 중에 첫째 컨트롤에 포커스를 맞춤
    //if($('form#frm input[type="text"][data-role]:visible')[0]) {
    //    $($('form#frm input[type="text"][data-role]:visible')[0]).focus();
    //}
    
    //임의의 특정컨트롤에 포커스를 맞춤.
	//$('input#BARCODE').focus();
}
*/
			
//내용조회 또는 수정/입력 페이지 로딩이 끝나는 순간 한번만 실행됨, 이때 처리해야할 일반 스크립트를 삽입합니다.
function viewLogic_afterLoad() {

	//debugger;
	//console.log(resultAll);
	//console.log(resultAll.d.results[0]);
	
	
	//각탭에 html 에디터를 통해 pdf 업로드나 pdf 링크가 href 가 1개만 있으면 뷰어로 변신
	//tab_pdf_into_viewer();

	//특정항목에 대한 내용을 바꾸는 코딩
    //$('div#table_mQmidx')[0].innerText = resultAll.d.results[0].table_mQmidx;
	
	//특정 tabid 를 넣으면 해당 탭이 먼저 열린다. 아래는 wdate 를 넣어서 등록정보 탭이 열리는 예제.
	//if($('input#ActionFlag')[0].value=='view') $('li[tabid="viewPrint"]').attr('active_tabid','wdate');


}			
//내용조회 또는 수정/입력 페이지 로딩이 끝난 후, 데이터 호출때마다 실행됨. 
function viewLogic_afterLoad_continue() {

	//debugger;
	//console.log(resultAll);
	//console.log(resultAll.d.results[0]);
	

}	
			
			
//사용자 정의 인쇄폼의 로딩이 완료될때 처리해야할 스크립트를 삽입합니다.
function viewLogic_afterLoad_viewPrint() {
	
	//아래는 특정이미지를 하단에 넣는 예제입니다.
	//$('div.viewPrint').append('<img style="position: absolute;bottom: 32px;left: 35px;width: 200px;" src="/_mis/img/speedmis_wide.png">');
	
}			

			
//입력 또는 수정 폼에서 우편번호 팝업 선택 직후, 추가로직을 넣을 수 있습니다. 아주 간혹 필요합니다.
/*
function addLogic_zipcode(zipdata) {
		//sido / sigungu / bname / jibunAddress
	$('input#dodo')[0].value = zipdata.sido.split(' ')[0];
	$('input#sigunggu')[0].value = zipdata.sigungu.split(' ')[0];
	$('input#dongmyeon')[0].value = zipdata.bname.split(' ')[0];
	$('input#beonji')[0].value = zipdata.jibunAddress.split(zipdata.bname+' ')[1];
}	
*/		
			
        </script>
        <?php 
}
//end pageLoad



function list_json_init() {

    
    include '../_mis/PHPExcleReader/Classes/PHPExcel/IOFactory.php';



    global $RealPid, $MisJoinPid, $logicPid, $parent_idx, $full_siteID;
    global $base_root, $flag, $selField, $app, $idx, $appSql, $resultCode, $resultMessage, $afterScript;
	//$flag 는 목록조회시 'read'   내용조회시 'view'    수정시 'modify'   입력시 'write'
	//$selField 는 필터링을 하는 순간 발생하는 필드alias 값.

	//아래의 예제는 자동정렬이라는 명령을 받았을 경우, 목록이 생성되기 전에 숫자를 정렬하는 기능입니다.
	$files = [
/*
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][강릉시][강릉시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][동해시태백시삼척시정선군][동해시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][동해시태백시삼척시정선군][삼척시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][동해시태백시삼척시정선군][정선군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][동해시태백시삼척시정선군][태백시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][속초시인제군고성군양양군][고성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][속초시인제군고성군양양군][속초시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][속초시인제군고성군양양군][양양군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][속초시인제군고성군양양군][인제군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][원주시갑][원주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][원주시을][원주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][춘천시철원군화천군양구군갑][춘천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][춘천시철원군화천군양구군을][양구군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][춘천시철원군화천군양구군을][철원군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][춘천시철원군화천군양구군을][춘천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][춘천시철원군화천군양구군을][화천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][홍천군횡성군영월군평창군][영월군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][홍천군횡성군영월군평창군][평창군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][홍천군횡성군영월군평창군][홍천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][강원특별자치도][홍천군횡성군영월군평창군][횡성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][고양시갑][고양시덕양구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][고양시병][고양시일산동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][고양시을][고양시덕양구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][고양시정][고양시일산서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][광명시갑][광명시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][광명시을][광명시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][광주시갑][광주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][광주시을][광주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][구리시][구리시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][군포시][군포시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][김포시갑][김포시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][김포시을][김포시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][남양주시갑][남양주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][남양주시병][남양주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][남양주시을][남양주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][동두천시양주시연천군갑][양주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][동두천시양주시연천군을][동두천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][동두천시양주시연천군을][연천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][부천시갑][부천시오정구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][부천시병][부천시소사구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][부천시을][부천시원미구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][성남시분당구갑][성남시분당구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][성남시분당구을][성남시분당구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][성남시수정구][성남시수정구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][성남시중원구][성남시중원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][수원시갑][수원시장안구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][수원시무][수원시권선구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][수원시병][수원시팔달구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][수원시을][수원시권선구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][수원시정][수원시영통구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][시흥시갑][시흥시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][시흥시을][시흥시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안산시갑][안산시상록구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안산시병][안산시단원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안산시을][안산시상록구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안성시][안성시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안양시동안구갑][안양시동안구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안양시동안구을][안양시동안구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][안양시만안구][안양시만안구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][여주시양평군][양평군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][여주시양평군][여주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][오산시][오산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][용인시갑][용인시처인구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][용인시병][용인시수지구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][용인시을][용인시기흥구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][용인시정][용인시기흥구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][의왕시과천시][과천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][의정부시갑][의정부시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][의정부시을][의정부시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][이천시][이천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][파주시갑][파주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][파주시을][파주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][평택시갑][평택시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][평택시병][평택시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][평택시을][평택시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][포천시가평군][가평군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][포천시가평군][포천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][하남시갑][하남시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][하남시을][하남시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][화성시갑][화성시갑]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][화성시병][화성시갑]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][화성시을][화성시을]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경기도][화성시정][화성시을]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][거제시][거제시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][김해시갑][김해시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][김해시을][김해시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][밀양시의령군함안군창녕군][밀양시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][밀양시의령군함안군창녕군][의령군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][밀양시의령군함안군창녕군][창녕군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][밀양시의령군함안군창녕군][함안군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][사천시남해군하동군][남해군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][사천시남해군하동군][사천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][사천시남해군하동군][하동군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][산청군함양군거창군합천군][거창군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][산청군함양군거창군합천군][산청군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][산청군함양군거창군합천군][함양군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][산청군함양군거창군합천군][합천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][양산시갑][양산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][양산시을][양산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][진주시갑][진주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][진주시을][진주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][창원시마산합포구][창원시마산합포구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][창원시마산회원구][창원시마산회원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][창원시성산구][창원시성산구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][창원시의창구][창원시의창구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][창원시진해구][창원시진해구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][통영시고성군][고성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상남도][통영시고성군][통영시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][경산시][경산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][경주시][경주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][고령군성주군칠곡군][고령군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][고령군성주군칠곡군][성주군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][고령군성주군칠곡군][칠곡군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][구미시갑][구미시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][구미시을][구미시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][김천시][김천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][상주시문경시][문경시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][상주시문경시][상주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][안동시예천군][안동시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][안동시예천군][예천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][영주시영양군봉화군][봉화군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][영주시영양군봉화군][영양군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][영주시영양군봉화군][영주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][영천시청도군][영천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][영천시청도군][청도군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][의성군청송군영덕군울진군][영덕군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][의성군청송군영덕군울진군][울진군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][의성군청송군영덕군울진군][의성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][의성군청송군영덕군울진군][청송군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][포항시남구울릉군][울릉군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][포항시남구울릉군][포항시남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][경상북도][포항시북구][포항시북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][광산구갑][광산구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][광산구을][광산구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][동구남구갑][남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][동구남구을][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][북구갑][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][북구을][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][서구갑][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][광주광역시][서구을][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][달서구갑][달서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][달서구병][달서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][달서구을][달서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][달성군][달성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][동구군위군갑][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][동구군위군을][군위군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][동구군위군을][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][북구갑][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][북구을][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][서구][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][수성구갑][수성구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][수성구을][수성구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][중구남구][남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대구광역시][중구남구][중구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][대덕구][대덕구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][동구][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][서구갑][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][서구을][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][유성구갑][유성구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][유성구을][유성구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][대전광역시][중구][중구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][강서구][강서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][금정구][금정구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][기장군][기장군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][남구][남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][동래구][동래구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][부산진구갑][부산진구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][부산진구을][부산진구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][북구갑][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][북구을][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][사상구][사상구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][사하구갑][사하구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][사하구을][사하구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][서구동구][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][서구동구][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][수영구][수영구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][연제구][연제구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][중구영도구][영도구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][중구영도구][중구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][해운대구갑][해운대구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][부산광역시][해운대구을][해운대구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강남구갑][강남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강남구병][강남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강남구을][강남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강동구갑][강동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강동구을][강동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강북구갑][강북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강북구을][강북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강서구갑][강서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강서구병][강서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][강서구을][강서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][관악구갑][관악구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][관악구을][관악구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][광진구갑][광진구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][광진구을][광진구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][구로구갑][구로구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][구로구을][구로구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][금천구][금천구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][노원구갑][노원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][노원구을][노원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][도봉구갑][도봉구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][도봉구을][도봉구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][동대문구갑][동대문구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][동대문구을][동대문구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][동작구갑][동작구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][동작구을][동작구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][마포구갑][마포구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][마포구을][마포구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][서대문구갑][서대문구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][서대문구을][서대문구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][서초구갑][서초구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][서초구을][서초구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][성북구갑][성북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][성북구을][성북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][송파구갑][송파구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][송파구병][송파구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][송파구을][송파구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][양천구갑][양천구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][양천구을][양천구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][영등포구갑][영등포구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][영등포구을][영등포구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][용산구][용산구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][은평구갑][은평구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][은평구을][은평구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][종로구][종로구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][중구성동구갑][성동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][중구성동구을][중구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][중랑구갑][중랑구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][서울특별시][중랑구을][중랑구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][세종특별자치시][세종특별자치시갑][세종특별자치시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][세종특별자치시][세종특별자치시을][세종특별자치시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][울산광역시][남구갑][남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][울산광역시][남구을][남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][울산광역시][동구][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][울산광역시][북구][북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][울산광역시][울주군][울주군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][울산광역시][중구][중구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][계양구갑][계양구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][계양구을][계양구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][남동구갑][남동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][남동구을][남동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][동구미추홀구갑][동구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][동구미추홀구갑][미추홀구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][동구미추홀구을][미추홀구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][부평구갑][부평구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][부평구을][부평구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][서구갑][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][서구병][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][서구을][서구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][연수구갑][연수구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][연수구을][연수구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][중구강화군옹진군][강화군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][중구강화군옹진군][옹진군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][인천광역시][중구강화군옹진군][중구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][고흥군보성군장흥군강진군][강진군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][고흥군보성군장흥군강진군][고흥군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][고흥군보성군장흥군강진군][보성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][고흥군보성군장흥군강진군][장흥군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][나주시화순군][나주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][나주시화순군][화순군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][담양군함평군영광군장성군][담양군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][담양군함평군영광군장성군][영광군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][담양군함평군영광군장성군][장성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][담양군함평군영광군장성군][함평군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][목포시][목포시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][순천시광양시곡성군구례군갑][순천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][순천시광양시곡성군구례군을][곡성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][순천시광양시곡성군구례군을][광양시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][순천시광양시곡성군구례군을][구례군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][여수시갑][여수시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][여수시을][여수시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][영암군무안군신안군][무안군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][영암군무안군신안군][신안군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][영암군무안군신안군][영암군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][해남군완도군진도군][완도군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][해남군완도군진도군][진도군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전라남도][해남군완도군진도군][해남군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][군산시김제시부안군갑][군산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][군산시김제시부안군을][김제시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][군산시김제시부안군을][부안군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][남원시장수군임실군순창군][남원시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][남원시장수군임실군순창군][순창군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][남원시장수군임실군순창군][임실군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][남원시장수군임실군순창군][장수군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][완주군진안군무주군][무주군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][완주군진안군무주군][완주군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][완주군진안군무주군][진안군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][익산시갑][익산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][익산시을][익산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][전주시갑][전주시완산구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][전주시병][전주시덕진구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][전주시을][전주시완산구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][정읍시고창군][고창군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][전북특별자치도][정읍시고창군][정읍시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][제주특별자치도][서귀포시][서귀포시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][제주특별자치도][제주시갑][제주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][제주특별자치도][제주시을][제주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][공주시부여군청양군][공주시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][공주시부여군청양군][부여군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][공주시부여군청양군][청양군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][논산시계룡시금산군][금산군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][당진시][당진시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][보령시서천군][보령시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][보령시서천군][서천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][서산시태안군][서산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][아산시갑][아산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][아산시을][아산시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][천안시갑][천안시동남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][천안시병][천안시동남구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][천안시을][천안시서북구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][홍성군예산군][예산군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청남도][홍성군예산군][홍성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][보은군옥천군영동군괴산군][괴산군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][보은군옥천군영동군괴산군][보은군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][보은군옥천군영동군괴산군][영동군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][보은군옥천군영동군괴산군][옥천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][제천시단양군][단양군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][제천시단양군][제천시]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][증평군진천군음성군][음성군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][증평군진천군음성군][증평군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][증평군진천군음성군][진천군]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][청주시상당구][청주시상당구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][청주시서원구][청주시서원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][청주시청원구][청주시청원구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][청주시흥덕구][청주시흥덕구]',
'[제22대_국회의원선거]_개표단위별_개표결과[국회의원선거][충청북도][충주시][충주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][강릉시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][고성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][동해시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][삼척시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][속초시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][양구군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][양양군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][영월군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][원주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][인제군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][정선군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][철원군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][춘천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][태백시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][평창군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][홍천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][화천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][강원도][횡성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][가평군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][고양시덕양구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][고양시일산동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][고양시일산서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][과천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][광명시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][광주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][구리시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][군포시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][김포시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][남양주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][동두천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][부천시소사구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][부천시오정구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][부천시원미구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][성남시분당구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][성남시수정구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][성남시중원구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][수원시권선구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][수원시영통구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][수원시장안구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][수원시팔달구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][시흥시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][안산시단원구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][안산시상록구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][안성시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][안양시동안구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][안양시만안구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][양주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][양평군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][여주군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][연천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][오산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][용인시기흥구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][용인시수지구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][용인시처인구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][의왕시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][의정부시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][이천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][파주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][평택시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][포천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][하남시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경기도][화성시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][거제시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][거창군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][고성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][김해시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][남해군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][밀양시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][사천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][산청군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][양산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][의령군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][진주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][창녕군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][창원시마산합포구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][창원시마산회원구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][창원시성산구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][창원시의창구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][창원시진해구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][통영시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][하동군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][함안군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][함양군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상남도][합천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][경산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][경주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][고령군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][구미시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][군위군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][김천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][문경시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][봉화군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][상주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][성주군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][안동시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][영덕군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][영양군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][영주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][영천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][예천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][울릉군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][울진군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][의성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][청도군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][청송군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][칠곡군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][포항시남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][경상북도][포항시북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][광주광역시][광산구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][광주광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][광주광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][광주광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][광주광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][달서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][달성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][수성구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대구광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대전광역시][대덕구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대전광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대전광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대전광역시][유성구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][대전광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][강서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][금정구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][기장군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][동래구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][부산진구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][사상구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][사하구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][수영구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][연제구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][영도구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][부산광역시][해운대구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][강남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][강동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][강북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][강서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][관악구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][광진구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][구로구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][금천구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][노원구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][도봉구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][동대문구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][동작구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][마포구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][서대문구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][서초구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][성동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][성북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][송파구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][양천구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][영등포구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][용산구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][은평구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][종로구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][서울특별시][중랑구]',
*/

/*
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][세종특별자치시][연기군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][울산광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][울산광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][울산광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][울산광역시][울주군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][울산광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][강화군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][계양구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][남동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][부평구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][연수구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][옹진군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][인천광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][강진군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][고흥군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][곡성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][광양시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][구례군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][나주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][담양군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][목포시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][무안군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][보성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][순천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][신안군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][여수시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][영광군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][영암군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][완도군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][장성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][장흥군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][진도군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][함평군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][해남군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라남도][화순군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][고창군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][군산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][김제시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][남원시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][무주군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][부안군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][순창군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][완주군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][익산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][임실군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][장수군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][전주시덕진구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][전주시완산구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][정읍시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][전라북도][진안군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][제주특별자치도][서귀포시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][제주특별자치도][제주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][계룡시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][공주시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][금산군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][논산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][당진시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][보령시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][부여군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][서산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][서천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][아산시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][예산군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][천안시동남구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][천안시서북구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][청양군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][태안군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청남도][홍성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][괴산군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][단양군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][보은군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][영동군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][옥천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][음성군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][제천시]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][증평군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][진천군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][청원군]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][청주시상당구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][청주시흥덕구]',
'개표현황(읍면동별)[제19대][국회의원선거][국회의원선거][충청북도][충주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][강릉시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][고성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][동해시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][삼척시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][속초시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][양구군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][양양군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][영월군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][원주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][인제군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][정선군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][철원군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][춘천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][태백시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][평창군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][홍천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][화천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][강원도][횡성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][가평군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][고양시덕양구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][고양시일산동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][고양시일산서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][과천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][광명시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][광주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][구리시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][군포시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][김포시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][남양주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][동두천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][부천시소사구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][부천시오정구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][부천시원미구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][성남시분당구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][성남시수정구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][성남시중원구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][수원시권선구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][수원시영통구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][수원시장안구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][수원시팔달구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][시흥시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][안산시단원구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][안산시상록구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][안성시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][안양시동안구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][안양시만안구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][양주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][양평군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][여주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][연천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][오산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][용인시기흥구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][용인시수지구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][용인시처인구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][의왕시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][의정부시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][이천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][파주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][평택시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][포천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][하남시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경기도][화성시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][거제시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][거창군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][고성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][김해시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][남해군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][밀양시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][사천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][산청군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][양산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][의령군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][진주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][창녕군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][창원시마산합포구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][창원시마산회원구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][창원시성산구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][창원시의창구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][창원시진해구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][통영시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][하동군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][함안군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][함양군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상남도][합천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][경산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][경주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][고령군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][구미시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][군위군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][김천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][문경시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][봉화군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][상주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][성주군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][안동시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][영덕군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][영양군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][영주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][영천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][예천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][울릉군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][울진군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][의성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][청도군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][청송군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][칠곡군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][포항시남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][경상북도][포항시북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][광주광역시][광산구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][광주광역시][남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][광주광역시][동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][광주광역시][북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][광주광역시][서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][달서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][달성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][수성구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대구광역시][중구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대전광역시][대덕구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대전광역시][동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대전광역시][서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대전광역시][유성구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][대전광역시][중구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][강서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][금정구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][기장군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][동래구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][부산진구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][사상구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][사하구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][수영구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][연제구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][영도구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][중구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][부산광역시][해운대구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][강남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][강동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][강북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][강서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][관악구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][광진구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][구로구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][금천구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][노원구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][도봉구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][동대문구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][동작구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][마포구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][서대문구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][서초구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][성동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][성북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][송파구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][양천구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][영등포구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][용산구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][은평구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][종로구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][중구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][서울특별시][중랑구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][세종특별자치시][세종특별자치시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][울산광역시][남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][울산광역시][동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][울산광역시][북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][울산광역시][울주군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][울산광역시][중구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][강화군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][계양구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][남동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][동구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][부평구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][서구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][연수구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][옹진군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][인천광역시][중구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][강진군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][고흥군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][곡성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][광양시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][구례군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][나주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][담양군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][목포시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][무안군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][보성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][순천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][신안군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][여수시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][영광군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][영암군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][완도군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][장성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][장흥군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][진도군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][함평군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][해남군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라남도][화순군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][고창군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][군산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][김제시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][남원시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][무주군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][부안군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][순창군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][완주군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][익산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][임실군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][장수군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][전주시덕진구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][전주시완산구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][정읍시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][전라북도][진안군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][제주특별자치도][서귀포시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][제주특별자치도][제주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][계룡시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][공주시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][금산군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][논산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][당진시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][보령시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][부여군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][서산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][서천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][아산시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][예산군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][천안시동남구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][천안시서북구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][청양군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][태안군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청남도][홍성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][괴산군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][단양군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][보은군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][영동군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][옥천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][음성군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][제천시]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][증평군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][진천군]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][청주시상당구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][청주시서원구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][청주시청원구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][청주시흥덕구]',
'개표현황(읍면동별)[제20대][국회의원선거][국회의원선거][충청북도][충주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][강릉시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][고성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][동해시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][삼척시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][속초시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][양구군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][양양군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][영월군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][원주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][인제군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][정선군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][철원군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][춘천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][태백시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][평창군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][홍천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][화천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][강원도][횡성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][가평군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][고양시덕양구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][고양시일산동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][고양시일산서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][과천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][광명시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][광주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][구리시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][군포시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][김포시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][남양주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][동두천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][부천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][성남시분당구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][성남시수정구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][성남시중원구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][수원시권선구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][수원시영통구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][수원시장안구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][수원시팔달구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][시흥시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][안산시단원구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][안산시상록구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][안성시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][안양시동안구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][안양시만안구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][양주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][양평군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][여주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][연천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][오산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][용인시기흥구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][용인시수지구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][용인시처인구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][의왕시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][의정부시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][이천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][파주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][평택시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][하남시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경기도][화성시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][거제시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][거창군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][고성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][김해시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][남해군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][밀양시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][사천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][산청군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][양산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][의령군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][진주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][창녕군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][창원시마산합포구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][창원시마산회원구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][창원시성산구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][창원시의창구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][창원시진해구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][통영시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][하동군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][함안군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][함양군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상남도][합천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][경산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][경주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][고령군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][구미시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][군위군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][김천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][문경시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][봉화군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][상주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][성주군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][안동시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][영덕군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][영양군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][영주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][영천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][예천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][울릉군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][울진군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][의성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][청도군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][청송군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][칠곡군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][포항시남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][경상북도][포항시북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][광주광역시][광산구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][광주광역시][남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][광주광역시][동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][광주광역시][북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][광주광역시][서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][달서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][달성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][수성구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대구광역시][중구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대전광역시][대덕구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대전광역시][동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대전광역시][서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대전광역시][유성구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][대전광역시][중구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][강서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][금정구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][기장군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][동래구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][부산진구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][사상구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][사하구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][수영구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][연제구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][영도구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][중구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][부산광역시][해운대구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][강남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][강동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][강북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][강서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][관악구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][광진구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][구로구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][금천구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][노원구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][도봉구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][동대문구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][동작구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][마포구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][서대문구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][서초구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][성동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][성북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][송파구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][양천구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][영등포구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][용산구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][은평구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][종로구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][중구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][서울특별시][중랑구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][세종특별자치시][세종특별자치시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][울산광역시][남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][울산광역시][동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][울산광역시][북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][울산광역시][울주군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][울산광역시][중구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][강화군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][계양구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][남동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][동구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][미추홀구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][부평구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][서구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][연수구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][옹진군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][인천광역시][중구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][강진군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][고흥군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][곡성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][광양시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][구례군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][나주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][담양군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][목포시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][무안군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][보성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][순천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][신안군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][여수시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][영광군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][영암군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][완도군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][장성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][장흥군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][진도군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][함평군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][해남군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라남도][화순군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][고창군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][군산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][김제시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][무주군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][부안군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][순창군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][완주군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][익산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][임실군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][장수군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][전주시덕진구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][전주시완산구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][전라북도][정읍시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][제주특별자치도][서귀포시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][제주특별자치도][제주시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][계룡시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][금산군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][논산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][당진시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][보령시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][서산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][서천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][아산시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][예산군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][천안시동남구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][천안시서북구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][청양군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][태안군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청남도][홍성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][괴산군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][단양군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][보은군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][영동군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][옥천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][음성군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][제천시]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][증평군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][진천군]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][청주시상당구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][청주시서원구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][청주시청원구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][청주시흥덕구]',
'개표현황(읍면동별)[제21대][국회의원선거][국회의원선거][충청북도][충주시]'
*/
    ];
    //$files = [];
    for($i=0;$i<count($files);$i++) {
    
        if($app=='xxx') {
            $files_i = $files[$i];
            $files_i = replace($files_i, "\N", '') . '.xlsx';
            $f = $base_root . "vote/선관위엑셀자료/3.국회(총선)/$files_i";
            //echo $f;exit;
            if (!file_exists($f)) {
                exit("파일 없음");
            }

            $objPHPExcel = PHPExcel_IOFactory::load($f);

            $excelType = '';
            $dataRange = '';
		

            $타이틀 = $objPHPExcel->getActiveSheet()->getCell("A3");
            $타이틀 = replace($타이틀, "\N", '');
            //echo $타이틀;exit;
            
            if(InStr($files_i,'19대')>0) {
        		//19대용
                $fieldList = '선거구명,읍면동명,선거인수,투표수,F열,G열,H열,I열,J열,K열,L열,M열,N열,O열,P열,Q열,R열,S열,T열,U열,V열,W열,X열,Y열,Z열';
                $excelType = '발주양식1';
                $dataRange = 'A5:Y300';
            } else if(InStr($files_i,'20대')+InStr($files_i,'21대')>0) {
                //20,21대용.
                $fieldList = '선거구명,읍면동명,구분,선거인수,투표수,F열,G열,H열,I열,J열,K열,L열,M열,N열,O열,P열,Q열,R열,S열,T열,U열,V열,W열,X열,Y열';
                $excelType = '발주양식1';
                $dataRange = 'A5:Y300';
            } else if(InStr($files_i,'22대')>0) {
                //22대용.
                $fieldList = '읍면동명,구분,선거인수,투표수,F열,G열,H열,I열,J열,K열,L열,M열,N열,O열,P열,Q열,R열,S열,T열,U열,V열,W열,X열,Y열,Z열';
                $excelType = '발주양식1';
                $dataRange = 'A5:Y300';
            } else {
                echo $files_i;
                exit("알 수 없는 양식입니다. 관리자에게 문의하세요.");
            }

/*
            $objPHPExcel->getActiveSheet()
    ->getStyle($dataRange)
    ->getNumberFormat()
    ->setFormatCode( PHPExcel_Style_NumberFormat::FORMAT_TEXT );
*/

            

            $allData = $objPHPExcel->getActiveSheet()->rangeToArray($dataRange);
   
            $allData = json_encode($allData,JSON_UNESCAPED_UNICODE);
            $allData = replace($allData, '\n', ' ');
            $allData = replace($allData, '  ', ' ');
            $allData = splitVB($allData, ',[null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,')[0];
        //echo('/*zzzz]'.$allData);exit;
            $allData = Mid($allData, 2, 1000000);
            //$allData = Left($allData, Len($allData)-2);
           
            $allData = replace($allData, '"', "'");
            $allData = replace($allData, '[', '(');
            $allData = replace($allData, ']', ')');
            
//echo count(splitVB($allData,"'),"));exit;
            //'),


            $real_cnt = 0;

            
            $sql = " 
            delete from vote_국회의원 where 파일명='$files_i';
            
            insert into vote_국회의원 
            ($fieldList) 
            values 
            " . $allData . ";
            update vote_국회의원 set 파일명='$files_i',타이틀='$타이틀' where ifnull(파일명,'')='';
            ";
            execSql_gate($sql, 'my_local');

            //echo($sql );exit;
    //exit;
//echo $sql ;exit;
            //execSql($sql);

        }
    }
	
}
//end list_json_init

?>