<?php

function pageLoad() {

    global $ActionFlag, $RealPid, $parent_idx, $idx;
	global $MisSession_UserID, $MisSession_IsAdmin, $parent_RealPid;
/*
	//특정상황에서 페이지를 이동시키는 예제입니다.
	if($ActionFlag=='list' && $parent_RealPid=='speedmis000028') {
		$target_parent_gubun = RealPidIntoGubun('speedmis001071');
		$url = "index.php?RealPid=$RealPid&parent_gubun=$target_parent_gubun&parent_idx=$parent_idx";
		re_direct($url);
	}
*/

        ?>

<style>
/* 필요할 경우, 해당프로그램에 추가할 css 를 넣으세요 */
	
	
</style>


        <script>
			
//아래 한줄의 주석문을 풀면 리스트 상에서 내용조회나 수정으로 접근할 수 없습니다.
$('body').attr('onlylist','');			
//아래 한줄의 주석문을 풀면 리스트 상에서 목록1개만 로딩되어도 자동내용열림을 방지할 수 있습니다.
//$('body').attr('auto_open_refuse','');	
			
//간편추가 쿼리를 팝업이 아닌, 현재창에서 진행합니다.			
//$('body').attr('brief_insert_this_page','');
			
			
//엑셀을 이용한 인쇄폼에서 PDF 로 저장할 경우, 또는 인쇄폼에서 PDF 로 저장할 경우 용지나 여백을 조정해야할 경우.
/*
function thisPage_options_pdf() {
    return {
        paperSize: "A4",
		scale: 0.567,
		landscape: false,
		margin: { left: "0.2cm", top: "0.9cm", right: "1.0cm", bottom: "0.5cm" }
    }
}
*/
	
			
			
//웹소스 디테일에서 템플릿으로 체크한 항목에 대해 출력내용을 변경할 수 있습니다. 이때 목록 또는 본문내용에 동일하게 적용됩니다.
//row 갯수만큼 실행됩니다.
			
/*

function columns_templete(p_dataItem, p_aliasName) {

    if(p_aliasName=='AutoGubun') {

		//웹소스디테일의 데이터타입을 number^^#,##0 라고 지정 및 템플릿을 Y 로 했을 경우, 아래와 같은 식으로 하면 number 포맷으로 출력할 수 있음.
		//rValue = rValue + columns_format(p_dataItem, p_aliasName);


		var rValue = '<a href="index.php?RealPid=' + p_dataItem['RealPid'] + '&isMenuIn=Y" target="_blank" class="k-button">Go</a>';
		if(p_dataItem['MenuType']=='01') {
			rValue = rValue + '<a id="aid_' + p_dataItem['idx'] + '" href="index.php?RealPid=speedmis000266&idx=' 
				+ p_dataItem['RealPid'] + '&isMenuIn=Y" target="_blank" class="k-button">Source</a>';
		} else if(p_dataItem['MenuType']=='22') {
			rValue = rValue + '<a id="aid_' + p_dataItem['idx'] + '" href="index.php?RealPid=speedmis000989&idx=' 
				+ p_dataItem['RealPid'] + '&isMenuIn=Y" target="_blank" class="k-button">Source</a>';
		}
		rValue = rValue + p_dataItem['AutoGubun'];
        return rValue;
    } else {
        return p_dataItem[p_aliasName];
    }
}
*/

			
			
//아래의 함수는 목록에서만 해당되며, 템플릿으로 정의하지 않아도 특정항목의 값이나 태그를 추가할 수 있습니다. 
//row 갯수만큼 실행됩니다.
function rowFunction_UserDefine(p_this) {
/*
	p_this.MenuName = p_this.depth + p_this.LanguageCode; 
    p_this.AutoGubun = 
    "<a href=index.asp?gubun=" + p_this.idx + "&isMenuIn=Y target=_blank>[Go]</a> <a id='aid_" + p_this.idx + "' href=index.asp?RealPid=speedmis000266&idx=" + p_this.idx + "&isMenuIn=Y target=_blank>[Source]</a>?" 
    + p_this.AutoGubun;
*/
}

			
//아래는 그리드의 로딩이 거의 끝난 후, 항목에 스타일 시트를 적용하는 예입니다. 스타일 등을 직접 변경하려면 이 함수를 이용해야 합니다.
//row 갯수만큼 실행됩니다.
function rowFunctionAfter_UserDefine(p_this) {
/*
    if(p_this.AutoGubun.length==6) {
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).css("color","transparent");
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).css("color","transparent");
    } else if(p_this.AutoGubun.length==4) {
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG2")).css("color","transparent");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).css("color","transparent");
    } else if(p_this.AutoGubun.length==2) {
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG4")).css("color","transparent");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).attr("stopEdit","true");
        $(getCellObj_idx(p_this[key_aliasName], "SortG6")).css("color","transparent");
    }
*/
}
			
<?php 
//해당프로그램의 관리자 권한을 가진 사용자는 $MisSession_IsAdmin=='Y' 입니다. 필요 시, 여러 부분에서 해당 조건을 넣어 사용하세요.
//if($MisSession_IsAdmin=='Y' && $ActionFlag=='list') { 
			
//}
?>
//사용자 정의버튼 생성 예제입니다.
//툴바 명령버튼에 btn_1 이라고 하는 예비버튼을 "적용" 이라는 기능을 넣고, 클릭 시, 그리드에 app="적용" 이라는 신호로 보냅니다.
//이때 app=="적용" 에 대한 처리는 개발Tip 의 list_json_init() 를 참조하세요.
function thisLogic_toolbar() {
/*
    $("a#btn_1").text("적용");
    $("li#btn_1_overflow").text("적용");
    $("#btn_1").css("background", "#88f");
    $("#btn_1").css("color", "#fff");
    $("#btn_1").click( function() {
        $("#grid").data("kendoGrid").dataSource.transport.options.read.data.app = "적용";
        $("#grid").data("kendoGrid").dataSource.read();
        $("#grid").data("kendoGrid").dataSource.transport.options.read.data.app = "";
    });
*/
}

//목록에서 grid 로드 후 한번만 실행됨, 이때 처리해야할 일반 스크립트를 삽입합니다.
function listLogic_afterLoad_once()	{
	grid_remove_sort();    //그리드의 상단 정렬 기능 제거를 원할 경우.
	
}
			
//목록에서 grid 로드 후 데이터 로딩마다 실행됨, 이때 처리해야할 일반 스크립트를 삽입합니다.		
function listLogic_afterLoad_continue()	{
	
	
}

function helpboxLogic_afterSelect(p_actionFlag, p_opener, p_sel_alias, p_sel_value) {
	//dropdownlist 에 의한 helplist (popup) 선택 직후 추가 작업이 필요할 경우 사용합니다.
	/*
	if(p_actionFlag=='write' && p_sel_alias=='TUNE_CD') {
		v = p_sel_value;
		//p_opener.$('input#vTUNE_CD')[0].value = v;
	}
	*/
	
}

//업무용 MIS 의 목록형태가 save_templist 일 경우, 데이터가 추가될때마다 자동화면clear 대신 임의설정을 하고자할때 활성화 시켜서 사용할 것.
/*			
function templist_write_form_clear() {
    
	//자동 forme clear
    //write_form_clear();  
	
	//입력컨트롤 중에 첫째 컨트롤에 포커스를 맞춤
    //if($('form#frm input[type="text"][data-role]:visible')[0]) {
    //    $($('form#frm input[type="text"][data-role]:visible')[0]).focus();
    //}
    
    //임의의 특정컨트롤에 포커스를 맞춤.
	//$('input#BARCODE').focus();
}
*/
			
//내용조회 또는 수정/입력 페이지 로딩이 끝나는 순간 한번만 실행됨, 이때 처리해야할 일반 스크립트를 삽입합니다.
function viewLogic_afterLoad() {

	//debugger;
	//console.log(resultAll);
	//console.log(resultAll.d.results[0]);
	
	
	//각탭에 html 에디터를 통해 pdf 업로드나 pdf 링크가 href 가 1개만 있으면 뷰어로 변신
	//tab_pdf_into_viewer();

	//특정항목에 대한 내용을 바꾸는 코딩
    //$('div#table_mQmidx')[0].innerText = resultAll.d.results[0].table_mQmidx;
	
	//특정 tabid 를 넣으면 해당 탭이 먼저 열린다. 아래는 wdate 를 넣어서 등록정보 탭이 열리는 예제.
	//if($('input#ActionFlag')[0].value=='view') $('li[tabid="viewPrint"]').attr('active_tabid','wdate');


}			
//내용조회 또는 수정/입력 페이지 로딩이 끝난 후, 데이터 호출때마다 실행됨. 
function viewLogic_afterLoad_continue() {

	//debugger;
	//console.log(resultAll);
	//console.log(resultAll.d.results[0]);
	

}	
			
			
//사용자 정의 인쇄폼의 로딩이 완료될때 처리해야할 스크립트를 삽입합니다.
function viewLogic_afterLoad_viewPrint() {
	
	//아래는 특정이미지를 하단에 넣는 예제입니다.
	//$('div.viewPrint').append('<img style="position: absolute;bottom: 32px;left: 35px;width: 200px;" src="/_mis/img/speedmis_wide.png">');
	
}			

			
//입력 또는 수정 폼에서 우편번호 팝업 선택 직후, 추가로직을 넣을 수 있습니다. 아주 간혹 필요합니다.
/*
function addLogic_zipcode(zipdata) {
		//sido / sigungu / bname / jibunAddress
	$('input#dodo')[0].value = zipdata.sido.split(' ')[0];
	$('input#sigunggu')[0].value = zipdata.sigungu.split(' ')[0];
	$('input#dongmyeon')[0].value = zipdata.bname.split(' ')[0];
	$('input#beonji')[0].value = zipdata.jibunAddress.split(zipdata.bname+' ')[1];
}	
*/		
			
        </script>
        <?php 
}
//end pageLoad



function list_json_init() {

    
    include '../_mis/PHPExcleReader/Classes/PHPExcel/IOFactory.php';



    global $RealPid, $MisJoinPid, $logicPid, $parent_idx, $full_siteID;
    global $base_root, $flag, $selField, $app, $idx, $appSql, $resultCode, $resultMessage, $afterScript;
	//$flag 는 목록조회시 'read'   내용조회시 'view'    수정시 'modify'   입력시 'write'
	//$selField 는 필터링을 하는 순간 발생하는 필드alias 값.

	//아래의 예제는 자동정렬이라는 명령을 받았을 경우, 목록이 생성되기 전에 숫자를 정렬하는 기능입니다.
	$files = [
/*
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][강릉시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][고성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][동해시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][삼척시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][속초시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][양구군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][양양군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][영월군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][원주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][인제군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][정선군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][철원군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][춘천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][태백시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][평창군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][홍천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][화천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][강원도][횡성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][가평군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][고양시덕양구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][고양시일산동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][고양시일산서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][과천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][광명시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][광주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][구리시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][군포시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][김포시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][남양주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][동두천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][부천시소사구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][부천시오정구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][부천시원미구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][성남시분당구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][성남시수정구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][성남시중원구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][수원시권선구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][수원시영통구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][수원시장안구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][수원시팔달구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][시흥시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][안산시단원구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][안산시상록구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][안성시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][안양시동안구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][안양시만안구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][양주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][양평군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][여주군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][연천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][오산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][용인시기흥구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][용인시수지구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][용인시처인구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][의왕시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][의정부시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][이천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][파주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][평택시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][포천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][하남시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경기도][화성시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][거제시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][거창군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][고성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][김해시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][남해군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][밀양시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][사천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][산청군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][양산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][의령군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][진주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][창녕군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][창원시마산합포구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][창원시마산회원구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][창원시성산구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][창원시의창구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][창원시진해구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][통영시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][하동군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][함안군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][함양군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상남도][합천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][경산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][경주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][고령군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][구미시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][군위군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][김천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][문경시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][봉화군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][상주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][성주군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][안동시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][영덕군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][영양군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][영주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][영천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][예천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][울진군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][의성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][청도군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][청송군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][칠곡군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][포항시남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][경상북도][포항시북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][광주광역시][광산구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][광주광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][광주광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][광주광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][광주광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][달서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][달성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][수성구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대구광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대전광역시][대덕구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대전광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대전광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대전광역시][유성구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][대전광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][강서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][금정구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][기장군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][동래구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][사상구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][사하구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][수영구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][연제구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][영도구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][부산광역시][해운대구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][강남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][강동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][강북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][강서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][관악구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][광진구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][구로구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][금천구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][노원구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][도봉구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][동대문구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][동작구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][마포구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][서대문구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][서초구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][성동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][성북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][송파구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][양천구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][영등포구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][용산구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][은평구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][종로구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][서울특별시][중랑구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][세종특별자치시][연기군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][울산광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][울산광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][울산광역시][북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][울산광역시][울주군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][울산광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][강화군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][계양구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][남동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][동구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][부평구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][서구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][연수구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][옹진군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][인천광역시][중구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][강진군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][고흥군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][곡성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][광양시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][구례군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][나주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][담양군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][목포시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][무안군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][보성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][순천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][신안군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][여수시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][영광군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][영암군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][완도군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][장성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][장흥군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][진도군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][함평군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][해남군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라남도][화순군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][고창군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][군산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][김제시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][남원시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][무주군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][부안군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][순창군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][완주군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][익산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][임실군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][장수군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][전주시덕진구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][전주시완산구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][정읍시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][전라북도][진안군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][제주특별자치도][서귀포시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][제주특별자치도][제주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][계룡시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][공주시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][금산군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][논산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][당진시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][보령시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][부여군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][서산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][서천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][아산시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][예산군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][천안시동남구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][천안시서북구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][청양군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][태안군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청남도][홍성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][괴산군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][단양군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][보은군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][영동군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][옥천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][음성군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][제천시]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][증평군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][진천군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][청원군]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][청주시상당구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][청주시흥덕구]',
'개표현황(읍면동별)[제19대][국회의원선거][비례대표국회의원선거][충청북도][충주시]'
*/
    ];

    for($i=0;$i<count($files);$i++) {
    
        if($app=='xxx') {
            $files_i = $files[$i];
            $files_i = replace($files_i, "\N", '') . '.xlsx';
            $f = $base_root . "vote/선관위엑셀자료/5.비례(총선)/$files_i";
            //echo $f;exit;
            if (!file_exists($f)) {
                exit("파일 없음");
            }

            $objPHPExcel = PHPExcel_IOFactory::load($f);

            $excelType = '';
            $dataRange = '';

            $타이틀 = $objPHPExcel->getActiveSheet()->getCell("A3");
            $타이틀 = replace($타이틀, "\N", '');
            //echo $파일명;exit;
            
            if($타이틀!='' && $objPHPExcel->getActiveSheet()->getCell("D6")=="새누리당" && $objPHPExcel->getActiveSheet()->getCell("T6")=="청년당") {
				$excelType = '발주양식1';
                $dataRange = 'A7:Z100';
				$fieldList = '읍면동명,선거인수,투표수,새누리당,민주통합당,자유선진당,통합진보당,창조한국당,국민생각,가자대국민중심당,친박연합,국민행복당,기독당,녹색당,대한국당,미래연합,불교연합당,정통민주당,진보신당,청년당,한국기독당,한국문화예술당,한나라당,계,무효투표수,기권수';
            } else {
                //알수 없는 양식
		
                exit($파일명 . "; 알 수 없는 양식입니다. 관리자에게 문의하세요." . $objPHPExcel->getActiveSheet()->getCell("B5") . $objPHPExcel->getActiveSheet()->getCell("G5"));
            }

        


            $allData = $objPHPExcel->getActiveSheet()->rangeToArray($dataRange);
   
            $allData = json_encode($allData,JSON_UNESCAPED_UNICODE);
            $allData = replace($allData, '\n', ' ');
            $allData = replace($allData, '  ', ' ');
            $allData = splitVB($allData, ',[null,null,null,null,null,null,')[0];
        //echo('/*zzzz]'.$allData);exit;
        $allData = Mid($allData, 2, 1000000);
            //$allData = Left($allData, Len($allData)-2);
           
            $allData = replace($allData, '"', "'");
            $allData = replace($allData, '[', '(');
            $allData = replace($allData, ']', ')');

            
            $sql = " 
            delete from vote_비례19 where 파일명='$files_i';
            
            insert into vote_비례19 
            ($fieldList) 
            values 
            " . $allData . ";
            update vote_비례19 set 파일명='$files_i',타이틀='$타이틀' where ifnull(파일명,'')='';
            ";
		
		//echo($sql );exit;
		
            execSql_gate($sql, 'my_local');

           


        }
    }
	
}
//end list_json_init

?>